# <font color='green'> <b>Missing Values</b><font color='black'>
    
[SOURCE01](https://www.educative.io/edpresso/what-is-the-none-keyword-in-python), 
[SOURCE02](https://stackoverflow.com/questions/21095654/what-is-a-nonetype-object),
[SOURCE03](https://www.skytowner.com/explore/difference_between_none_and_nan_in_pandas), 
[SOURCE04](https://kegui.medium.com/what-is-the-difference-between-nan-none-pd-nan-and-np-nan-a8ee0532e2eb),
[SOURCE05](https://stackoverflow.com/questions/53436339/difference-between-np-nan-and-np-nan),
[SOURCE06](https://stackoverflow.com/questions/40309789/difference-between-nan-and-nan-in-python),
[SOURCE07](https://towardsdatascience.com/navigating-the-hell-of-nans-in-python-71b12558895b)

**None**:
   - Python'da "hiçbir şey" anlamına gelir.
   - Python'da bir nesnenin değeri olmadığını göstermek için kullanılır.
   - Tipi NoneType'dır ve sadece tek bir değeri vardır: None.
   - Örneğin, bir fonksiyonun herhangi bir değer döndürmemesi durumunda, Python otomatik olarak None döndürür.
   
**nan ve NaN**:
   - "Not a Number" ifadesinin kısaltmasıdır.
   - float tipinde bir değeri temsil eder.
   - Sayısal olmayan değerleri göstermek için kullanılır. 
   - Pandas ve Numpy gibi kütüphanelerde, kayıp veriyi (missing data) temsil etmek için de kullanılır.
   - nan değerleri eşitlikle karşılaştırıldığında her zaman False döndürür. Yani, nan == nan ifadesi False sonucunu verir. 
   - nan ve NaN arasında teknik bir fark yoktur. Farklı kaynaklarda veya kütüphanelerde farklı yazım biçimleri tercih edilir, ancak ikisi de aynı anlama gelir.

**Özetle**:
- None Python'ın özgün bir değeridir ve "değer yok" anlamına gelir.
- nan veya NaN sayısal olmayan değerleri temsil eder ve genellikle kayıp veri veya matematiksel olarak tanımlanmayan işlemler için kullanılır. 

Bu iki değer farklı tiplere aittir ve farklı durumlar için kullanılır. 

Uygulamada, veri analizi yaparken Pandas'ta sıkça NaN değerleriyle karşılaşırsınız. Ancak genel Python programlamasında None daha yaygındır.

In [1]:
import numpy as np
import pandas as pd 
import seaborn as sns

In [2]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", None, "FS", "FS", np.nan, "DS", "AWS"]
V1 = np.array([2, 3, 5, np.nan, 7, 1, np.nan, 10, 14, "-", 6])
V2 = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, None, 136, 60, 125, np.nan])

df0 = pd.DataFrame({
                   "id" : id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "var1" : V1,
                   "var2" : V2,
                   "salary" : salary
                  })

In [4]:
df0

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [5]:
df =df0.copy()

In [6]:
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   var1    11 non-null     object
 5   var2    8 non-null      float64
 6   salary  8 non-null      object
dtypes: float64(1), object(6)
memory usage: 748.0+ bytes

In [8]:
type(np.nan)

float

In [9]:
type(np.NAN)

float

In [10]:
type(None)

NoneType

In [11]:
pd.Series([1,np.nan,np.NAN,None,2])

0    1.0
1    NaN
2    NaN
3    NaN
4    2.0
dtype: float64

In [12]:
print("1", 0 * np.nan)
print("2", np.nan - np.nan)
print("3", np.nan + np.nan)
print("4", np.nan - 10)
print("5", np.nan + 10)
print("6", np.nan == np.nan) # değer olarak eşit değil. çünkü belirsiz.
print("7", 10 > np.nan)
print("8", np.inf > np.nan) # değeri belirsiz olduğu için
                    # sonsuz > nan diye sorguladığımızda bile false veriyor
print("9", float('-inf') < np.nan < float('inf')) # nan, eksi sonsuz ile artı sonsuz arasına düşen bir değer de değildir.
print("10", np.nan is np.nan) # is ile sorgulama yaptığınızda id değerlerini yani;
# memory location'ını sorgulamış olursunuz ki bu değerler aynıdır.
# Fakat bu; value'ları aynı demek değildir.

1 nan
2 nan
3 nan
4 nan
5 nan
6 False
7 False
8 False
9 False
10 True

In [13]:
id(np.nan)

2358114056976

In [14]:
id(np.NAN)

2358114056976

## <font color='blue'> <b>Detecting Missing Values</b><font color='black'>

In [15]:
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [16]:
df.isnull() # veri setindeki tum degerleri null olan degerleri True dondurur

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [17]:
df.isna()   # veri setindeki tum degerleri null olan degerleri True dondurur

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [18]:
df.notnull() # null olmayanlar true null olanlari false gosterir

      id  gender  status   dept  var1   var2  salary
0   True    True    True   True  True   True   False
1   True    True    True   True  True  False    True
2   True    True    True   True  True   True    True
3   True    True    True   True  True   True    True
4   True    True    True   True  True   True    True
5   True    True    True  False  True  False    True
6   True    True    True   True  True  False   False
7   True    True    True   True  True   True    True
8   True    True    True  False  True   True    True
9   True    True    True   True  True   True    True
10  True    True   False   True  True   True   False

In [19]:
df.notna()    #

      id  gender  status   dept  var1   var2  salary
0   True    True    True   True  True   True   False
1   True    True    True   True  True  False    True
2   True    True    True   True  True   True    True
3   True    True    True   True  True   True    True
4   True    True    True   True  True   True    True
5   True    True    True  False  True  False    True
6   True    True    True   True  True  False   False
7   True    True    True   True  True   True    True
8   True    True    True  False  True   True    True
9   True    True    True   True  True   True    True
10  True    True   False   True  True   True   False

In [20]:
df.isnull().any() # herhangi bir satirda null deger varsa bulundugu sutun True gosterir

id        False
gender    False
status     True
dept       True
var1      False
var2       True
salary     True
dtype: bool

In [21]:
df.isnull().any(axis=1)  #

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [22]:
df[df.isnull().any(axis=1)]

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
8   P009      M     PT   NaN   14   3.0     60
10  P011      M    NaN   AWS    6   9.0    NaN

In [23]:
df.isnull().sum()  # data setinin sutunlarindaki null degerleri gosterir

id        0
gender    0
status    1
dept      2
var1      0
var2      3
salary    3
dtype: int64

In [24]:
df.isnull().sum().sum()  # dataframe deki null degerleri gosterir

9

In [25]:
df.salary.isnull().sum()

3